# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\HackingChips\Peugeot3008Display\Firmware\PeugeotDisplay4245\PeugeotDisplay4245.cydsn\PeugeotDisplay4245.cyprj
# Date: Tue, 29 Sep 2020 13:08:33 GMT
#set_units -time ns
create_clock -name {Clock_1(FFB)} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 2 3} [list]


# Component constraints for C:\HackingChips\Peugeot3008Display\Firmware\PeugeotDisplay4245\PeugeotDisplay4245.cydsn\TopDesign\TopDesign.cysch
# Project: C:\HackingChips\Peugeot3008Display\Firmware\PeugeotDisplay4245\PeugeotDisplay4245.cydsn\PeugeotDisplay4245.cyprj
# Date: Tue, 29 Sep 2020 13:08:31 GMT
